Agat/src/Catalogs/ДоговораСубподряда/ДоговораСубподряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговораСубподряда</name>
  <basedOn>Catalog.Договора</basedOn>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговораПолностью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСЗаказчиком</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Тематика</name>
    <type>
      <types>CatalogRef.Тематика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разногласия</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнениеДоговора</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИсполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержаниеДоговора</name>
    <attributes>
      <name>НомерПунктаДоговора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Архив</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/ДоговораСубподряда/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Загрузка файлов ТЧ //////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общие модули:                                                              //
//   			РаботаСФайламиСервер:                                         //
//										Процедура ПриСозданииНаСервере 		  //
//              РаботаСФайламиКлиент:                                         //
//                                      Асинх Процедура КомандаДействие       //
//                                      Асинх Процедура КомандаУдалить        //
// Константы:                                                                 //
//              ПутьХранилищаФайлов:                                          //
//                                      Адрес файлового хранилища заданного   //
//                                      пользователем (Администратор)         //
// Реквизиты ТЧ:                                                              //
// 				РасширениеФайла - строка                                      //
//				УникальныйИдентификатор - УникальныйИдентификатор             // 
//                                      Присвоение имени файла в архиве HDD   //
// Реквизиты формы:                                                           //
//          	ПутьХранилища - строка                                        //
//                                      Хранение данных Константы:            //
//										ПутьХранилищаФайлов                   //
// Команды:                                                                   //
//          	КомандаДействие - Асинх Процедура КомандаДействие(Команда)    //
//                                (Присоединение / просомтр файла)			  //
//                                 Тригер - Реквизит ТЧ - РасширениеФайла     //
//          	КомандаУдалить  - Асинх Процедура КомандаУдалить(Команда)     //
// События:                                                                   //
//    	Форма:                                                                //
//				Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   //
//     	ТЧ:                                                                   //
//      	    Процедура ПриложенияПриАктивизацииСтроки(Элемент)             //
//      	    Процедура РазногласияПриАктивизацииСтроки(Элемент)            //
//      	    Процедура ИсполнениеДоговораПриАктивизацииСтроки(Элемент)     // 
//                                                                            //
// Особенности:                                                               //
//              Присвооение имени выгруженного файла по шаболну:              //
//              РаботаСФайламиКлиент - Функция СформироватьИмяФайлаИзДанных   // 
// шаболн:                                                                    //
//      ("%1_№ %2_от %3%4", Назв, Ном, Дат, ТекущиеДанные.РасширениеФайла)	  //
////////////////////////////////////////////////////////////////////////////////

// =============================================================================
// СИСТЕМНЫЕ СОБЫТИЯ ФОРМЫ
// ============================================================================= 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Формируем массив всех табличных частей, которые поддерживают работу с файлами
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("Приложения");
	МассивТЧ.Добавить("Разногласия");
	МассивТЧ.Добавить("ИсполнениеДоговора");
	МассивТЧ.Добавить("СодержаниеДоговора");
	МассивТЧ.Добавить("Архив");

	// Настраиваем программное условное оформление для отображения иконок (лупа/скрепка) 
	// в колонках ИмяТЧ+"Действие" и ИмяТЧ+"Удалить"
	РаботаСФайламиСервер.НастроитьОформлениеВсехТаблиц(ЭтаФорма, МассивТЧ);
	
	 										/////////////////////////////////////////////////////////////////////////////////
											// Одиночный выбор Сотрудника  // использование стандартной формы ввода
											/////////////////////////////////////////////////////////////////////////////////

											//////////////////////////////////////////////////////////////////////////////// 
											////////////////////////////////////////////////////////////////////////////////
			                                // 1. Наполняем список (как делали ранее)
										    ОбновитьВыпадающийСписокНаСервере();
										    
										    // 2. Убираем системные кнопки "+" и "Показать все" программно
										    Поле = Элементы.ОтветственныйИсполнитель;
										    Поле.РежимВыбораИзСписка = Истина;
										    
										    // Отключаем кнопки создания и расширенного выбора
										    Поле.КнопкаСоздания = Ложь;
										    Поле.КнопкаСпискаВыбора = Истина; // Оставляем только стрелочку вниз
										    
										    // Чтобы список не был шире самого поля
										    Поле.Ширина = 16; 
										    Поле.РастягиватьПоГоризонтали = Ложь;
																						
                                            ////////////////////////////////////////////////////////////////////////////////    	
	
ИтогОплаты = Объект.ИсполнениеДоговора.Итог("СуммаОплаты");
ИтогИсполнения = Объект.ИсполнениеДоговора.Итог("СуммаИсполнения");
ИсполнениеДоговораРазница = ИтогОплаты - ИтогИсполнения;
	
КонецПроцедуры

// =============================================================================
// УНИВЕРСАЛЬНЫЕ КОМАНДЫ (подключены ко всем кнопкам всех ТЧ)
// =============================================================================

&НаКлиенте
Асинх Процедура КомандаДействие(Команда)
	
	// 1. ОПРЕДЕЛЯЕМ ТАБЛИЦУ (самый надежный способ для 8.3.25)
	// Пытаемся найти кнопку по имени команды, если не выходит — берем текущий элемент
	ЭлементКнопка = ЭтаФорма.Элементы.Найти(Команда.Имя);
	Если ЭлементКнопка = Неопределено Тогда
		ЭлементКнопка = ЭтаФорма.ТекущийЭлемент;
	КонецЕсли;
	
	// Вычисляем имя таблицы из имени кнопки (отрезаем хвост "КнопкаДействие")
	ИмяТаблицы = СтрЗаменить(ЭлементКнопка.Имя, "КнопкаДействие", "");
	ЭлементТаблица = ЭтаФорма.Элементы.Найти(ИмяТаблицы);
	
	// 2. БЕЗОПАСНАЯ ПРОВЕРКА
	ТаблицаСуществует = (ЭлементТаблица <> Неопределено И ТипЗнч(ЭлементТаблица) = Тип("ТаблицаФормы"));
	
	Если ТаблицаСуществует Тогда
		// Проверяем наличие данных в самой ТЧ объекта
		Если Объект[ИмяТаблицы].Количество() = 0 Тогда
			ПоказатьОповещениеПользователя("Внимание", , "Таблица пуста!");
			Возврат;
		КонецЕсли;
	Иначе
		// Если по имени кнопки не нашли, выводим ваше сообщение
		ПоказатьОповещениеПользователя("Внимание", , "Выберите строку ТЧ");
		Возврат;
	КонецЕсли;

	// 3. АКТИВАЦИЯ (Принудительно выбираем первую строку, если фокус был в шапке)
	ЭтаФорма.ТекущийЭлемент = ЭлементТаблица;
	
	Если ЭлементТаблица.ТекущиеДанные = Неопределено Тогда
		// Активируем самую первую строку коллекции
		ЭлементТаблица.ТекущаяСтрока = Объект[ИмяТаблицы].ПолучитьИдентификатор();
	КонецЕсли;
	
	ТекущиеДанные = ЭлементТаблица.ТекущиеДанные;
	
	// 4. ВЫПОЛНЕНИЕ (оригинальный рабочий блок)
	Попытка
		Ждать РаботаСФайламиКлиент.ВыполнитьДействиеСФайлом(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;
	
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, ТекущиеДанные, ИмяТаблицы);
	ЭтаФорма.ОбновитьОтображениеДанных();                 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаУдалить(Команда)
	
	ИмяЭлемента = ЭтаФорма.ТекущийЭлемент.Имя;
	ТекущаяТЧ = СтрЗаменить(ИмяЭлемента, "КнопкаУдалить", "");
	ТекущиеДанные = Элементы[ТекущаяТЧ].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;

	Попытка
		Ждать РаботаСФайламиКлиент.УдалитьФайл(ЭтаФорма, ТекущиеДанные, ТекущаяТЧ);
	Исключение
		ПоказатьПредупреждение(, ОписаниеОшибки());
	КонецПопытки;
	
	// ГАРАНТИРОВАННОЕ ОБНОВЛЕНИЕ
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, ТекущиеДанные, ТекущаяТЧ);
	
	//  Обновить
	ЭтаФорма.ОбновитьОтображениеДанных();                 
	
КонецПроцедуры


// =============================================================================
// ОБРАБОТЧИКИ АКТИВИЗАЦИИ СТРОК (Обновление кнопок при перемещении курсора)
// =============================================================================
// --- СОБЫТИЯ АКТИВИЗАЦИИ (ОСТАЮТСЯ ИНДИВИДУАЛЬНЫМИ) ---

&НаКлиенте
Процедура ПриложенияПриАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "Приложения");
КонецПроцедуры

&НаКлиенте
Процедура РазногласияПриАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "Разногласия");
КонецПроцедуры

&НаКлиенте
Процедура ИсполнениеДоговораПриАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "ИсполнениеДоговора");
КонецПроцедуры

&НаКлиенте
Процедура СодержаниеДоговораАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "СодержаниеДоговора");
КонецПроцедуры
 
&НаКлиенте
Процедура АрхивАктивизацииСтроки(Элемент)
	РаботаСФайламиКлиент.ОбновитьИнтерфейсКнопок(ЭтаФорма, Элемент.ТекущиеДанные, "Архив");
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////           

											/////////////////////////////////////////////////////////////////////////////////
											// Одиночный выбор Сотрудника  // использование стандартной формы ввода
											/////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
//ОтветвенныйИсполнитель - одиночный выбор из выпадающего меню  (без кнопок)
////////////////////////////////////////////////////////////////////////////////


&НаСервере
Процедура ОбновитьВыпадающийСписокНаСервере()
	
	// Получаем элемент формы
	ПолеСписка = Элементы.ОтветственныйИсполнитель;
	ПолеСписка.СписокВыбора.Очистить();
	
	// Запрос к базе
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование КАК ФИО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ФИО";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Добавляем в коллекцию СписокВыбора элемента формы
		ПолеСписка.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.ФИО);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСотрудниковДляВыбора()
	
	Список = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаСкрытьСодержание(Команда)
	
	// Получаем элемент группы
	Группа = Элементы.ГруппаПредметДоговора;  
	
	// Находим кнопку на форме, которая связана с этой командой
	Кнопка = Элементы.КнопкаСкрытьГруппаПредметДоговора; // Это элемент кнопки, а не команда
	
	Если Группа.Видимость Тогда
		// Если группа видима - скрываем её
        Группа.Видимость = Ложь;
		// Меняем иконку кнопки (например, на "Скрыть" или любую другую)
		Элементы.КнопкаСкрытьГруппаПредметДоговора.Картинка = БиблиотекаКартинок.Стрелки;
		// Меняем подсказку для кнопки
//		Кнопка.Подсказка = "Показать содержание договора";
	Иначе
		// Если группа скрыта - показываем её
		Группа.Видимость = Истина;
		// Меняем иконку кнопки (исходную)
		Элементы.КнопкаСкрытьГруппаПредметДоговора.Картинка = БиблиотекаКартинок.Стрелки;
		// Меняем подсказку
//		Кнопка.Подсказка = "Скрыть содержание договора";
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////
// EXCEL для заполнения табличной части
///////////////////////////////////////////////////////////////////////////////////////////

 // EXCEL // Заполнение реквизитов справочника из EXCEL работает с ОбщейФормой 
 //  ТЧ   // ДиалогНастройкиКолонок и Общим модулем ЗагрузкаДанныхСервер
 /////////////////////////////////////////////////////////////////////////////////////////// 
 ///////////////////////////////////////////////////////////////////////////////////////////
 &НаКлиенте
 Процедура ЗагрузитьИзExcel(Команда)
	 
//	 ИмяЭлемента = ЭтаФорма.ТекущийЭлемент.Имя; 
	// Определяем имя текущей табличной части
//	ТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
//	ИмяТекущейТЧ = СтрЗаменить(ИмяЭлемента, "КомандаИзExcel", "");///
	
	// Проверяем, что имя ТЧ не пустое
//	Если ПустаяСтрока(ИмяТекущейТЧ) Тогда
//		Возврат;
//	КонецЕсли;

// 1. Выбор файла
// выбор/открытие файла Excel	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel файлы (*.xlsx;*.xlsm;*.xls)|*.xlsx;*.xlsm;*.xls";
	Диалог.Показать(Оповещение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
//=====================================================================================	
	// Определяем текущий элемент формы
    ТекущийЭлемент = ЭтаФорма.ТекущийЭлемент;
    Если ТекущийЭлемент = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем имя табличной части из имени элемента
    // Например, если элемент называется "Распоряжение", то имя ТЧ = "Распоряжение"
    ИмяТекущейТЧ = ТекущийЭлемент.Имя;
//=====================================================================================		
	ПутьКФайлу = ВыбранныеФайлы[0];
	
// 2. Определение полей (Шапка и ТЧ текущего договора)
	// Создаем СписокПолей для заполнения в зависимости от ТЧ
	СписокПолей = Новый СписокЗначений;	
	// Реквизиты для отображения в форме Выбора
	// ОПРЕДЕЛЯЕМ КОНКРЕТНЫЕ РЕКВИЗИТЫ ДЛЯ ЗАПОЛНЕНИЯ в коде
	// Создаем список полей для заполнения в зависимости от ТЧ
	Если ИмяТекущейТЧ = "СодержаниеДоговора" Тогда	
		 СписокПолей.Добавить("СодержаниеДоговора.НомерПунктаДоговора",         "№ пункта");
		 СписокПолей.Добавить("СодержаниеДоговора.Содержание",         "Содержание"); 
		 СписокПолей.Добавить("СодержаниеДоговора.Примечание",         "Примечание");
	КонецЕсли;
	
//////////////////////////////////////////////////////////////////////////////

// 3. Подготовка параметров для формы настройки
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("СписокПолей",    СписокПолей);
	ПараметрыДиалога.Вставить("СписокЛистов",   ЗагрузкаДанныхСервер.ПолучитьСписокЛистов(ПутьКФайлу));
	ПараметрыДиалога.Вставить("ИмяСправочника", "Договора");
    ПараметрыДиалога.Вставить("ИмяТЧ", ИмяТекущейТЧ); // Передаем имя ТЧ
	ПараметрыДиалога.Вставить("ПутьКФайлу", ПутьКФайлу);
	
	// Открытие ОТДЕЛЬНОГО БЛОКИРУЮЩЕГО ОКНА
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеНастройки", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДиалогНастройкиКолонок", 
	             ПараметрыДиалога, 
	             ЭтотОбъект, 
	             Истина, // Уникальность
	             , 
	             , 
	             ОповещениеЗакрытия, 
	             РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	     // 1. Очищаем ТЧ перед загрузкой, чтобы не дублировать данные
//    Объект.Распоряжение.Очистить(); 

	Попытка
		// 2. Вызываем сервер.
		// ПЕРЕДАЕМ Объект (ДанныеФормыСтруктура), чтобы сервер заполнил текущую форму
		ДанныеЛога  = ЗагрузкаДанныхСервер.ЗагрузитьДанные(
		    Объект.Ссылка,                      // 1. Приемник  ПЕРЕДАЕМ ССЫЛКУ
		    Результат.ПутьКФайлу,        // 2. Путь
		    Результат.НастройкиКолонок,  // 3. Настройки
		    Результат.СтартоваяСтрока,   // 4. Старт
		    Результат.КонечнаяСтрока,    // 5. Конец
		    "ДоговораСубподряда",                  // 6. ИмяСпр
		    Результат.ИмяЛиста           // 7. ЛистИмя
//			 СтатистикаЗагрузки           // Добавим 8-й параметр для возврата лога
		);

		// После загрузки на сервере, нужно обновить данные в форме
		ОповеститьОбИзменении(Объект.Ссылка); 
		Модифицированность = Ложь; // Чтобы не спрашивал о сохранении, если данные уже в базе
		Прочитать(); // Перечитывает данные из базы в форму


            ПоказатьОповещениеПользователя("Загрузка завершена", , "Успешно: " + ДанныеЛога.Успешно);
		
	Исключение
		Сообщить("Ошибка при загрузке: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

 //////////////////////////////////// ??????? НЕ ИСПЛЬЗУЕТСЯ - испльзуется скрипт общей формы
 ////////////////////////////////////////////////////////////////////////////////////////////////////////////
 ////////////////////////////////////////////////////////////////////////////////////////////////////////////
 
&НаСервере
Функция ЗагрузитьДанныеИзExcelНаСервере(СсылкаНаОбъект, ПутьКФайлу, НастройкиКолонок, СтартоваяСтрока, КонечнаяСтрока, ИмяТЧ, ИмяЛиста)
	
	КоличествоЗагруженных = 0;
	СтрокаЗаполнена = Ложь;
	ИмяРеквизита = "";
	
//============================================================	
// ОТЛАДКА - выводим полученные параметры
	ЗаписьЖурналаРегистрации("Загрузка Excel", УровеньЖурналаРегистрации.Информация, , , 
		"Путь: " + ПутьКФайлу + 
		", ИмяТЧ: " + ИмяТЧ + 
		", ИмяЛиста: " + ИмяЛиста +
		", Стартовая строка: " + СтартоваяСтрока +
		", Конечная строка: " + КонечнаяСтрока);
	
	// ОТЛАДКА - выводим настройки колонок (ИСПРАВЛЕНО)
	Для Каждого Колонка Из НастройкиКолонок Цикл
		ЗаписьЖурналаРегистрации("Настройка колонки", УровеньЖурналаРегистрации.Информация, , , 
			"Номер колонки Excel: " + Строка(Колонка));
	КонецЦикла; 
	
	// ПОДРОБНАЯ ОТЛАДКА
	ЗаписьЖурналаРегистрации("Excel загрузка - Шаг1", УровеньЖурналаРегистрации.Информация, , , 
		"Начало загрузки. Путь: " + ПутьКФайлу + ", ИмяТЧ: " + ИмяТЧ + ", ИмяЛиста: " + ИмяЛиста);
//============================================================	
	
	// Получаем объект справочника
	ОбъектСправочника = СсылкаНаОбъект.ПолучитьОбъект();
	
	Если ОбъектСправочника = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Excel загрузка - Ошибка", УровеньЖурналаРегистрации.Ошибка, , , "Объект справочника не получен");
		Возврат 0;
	КонецЕсли;
	
//============================================================	
	ЗаписьЖурналаРегистрации("Excel загрузка - Шаг2", УровеньЖурналаРегистрации.Информация, , , "Объект справочника получен");
	
	// Проверяем существование табличной части
	Попытка
		ТЧ = ОбъектСправочника[ИмяТЧ];
		ЗаписьЖурналаРегистрации("Табличная часть найдена", УровеньЖурналаРегистрации.Информация);
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, , , "Табличная часть '" + ИмяТЧ + "' не найдена!");
		Возврат 0;
	КонецПопытки;
//============================================================	
	
	// Создаем COM-объект Excel
	Попытка
		
		ЗаписьЖурналаРегистрации("Excel загрузка - Шаг4", УровеньЖурналаРегистрации.Информация, , , "Создание COM-объекта Excel");
		
		Excel = Новый COMОбъект("Excel.Application");
		Excel.DisplayAlerts = Ложь;
		Excel.Visible = Ложь;
		
		ЗаписьЖурналаРегистрации("Excel загрузка - Шаг5", УровеньЖурналаРегистрации.Информация, , , "Открытие файла: " + ПутьКФайлу);
		
		Книга = Excel.Workbooks.Open(ПутьКФайлу);
		Лист = Книга.Worksheets(ИмяЛиста);
		
		ЗаписьЖурналаРегистрации("Excel загрузка - Шаг6", УровеньЖурналаРегистрации.Информация, , , "Файл открыт, лист: " + ИмяЛиста);
		
		// Определяем диапазон для чтения
		Если КонечнаяСтрока = 0 Или КонечнаяСтрока < СтартоваяСтрока Тогда
			ПоследняяСтрока = Лист.UsedRange.Rows.Count;
			КонечнаяСтрока = ПоследняяСтрока;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Диапазон Excel", УровеньЖурналаРегистрации.Информация, , , 
			"Строки с " + СтартоваяСтрока + " по " + КонечнаяСтрока);
		
		// Очищаем табличную часть
//		ОбъектСправочника[ИмяТЧ].Очистить();

		// Список реквизитов ТЧ в нужном порядке
		СписокРеквизитов = Новый Массив;
		СписокРеквизитов.Добавить("НомерПунктаДоговора");
		СписокРеквизитов.Добавить("Содержание");
		СписокРеквизитов.Добавить("Примечание");
		СписокРеквизитов.Добавить("ДатаДокумента");
		СписокРеквизитов.Добавить("Исполнитель");
				
		ЗаписьЖурналаРегистрации("Excel загрузка - Шаг8", УровеньЖурналаРегистрации.Информация, , , 
			"Количество настроек колонок: " + НастройкиКолонок.Количество());

		// Читаем данные и заполняем табличную часть
		Для НомерСтроки = СтартоваяСтрока По КонечнаяСтрока Цикл
			НоваяСтрока = ОбъектСправочника[ИмяТЧ].Добавить();
			СтрокаЗаполнена = Ложь;
			
			Для Индекс = 0 По НастройкиКолонок.Количество() - 1 Цикл
				// Получаем номер колонки из настроек
				ЭлементНастройки = НастройкиКолонок[Индекс];
				
				НомерКолонки = 0;
				Если ТипЗнч(ЭлементНастройки) = Тип("Число") Тогда
					НомерКолонки = ЭлементНастройки;
				ИначеЕсли ТипЗнч(ЭлементНастройки) = Тип("СписокЗначений") Тогда
					НомерКолонки = ЭлементНастройки.Значение;
				Иначе
					НомерКолонки = ЭлементНастройки;
				КонецЕсли;
				
				Если НомерКолонки <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				// Получаем имя реквизита из списка по индексу
				Если Индекс < СписокРеквизитов.Количество() Тогда
					ИмяРеквизита = СписокРеквизитов[Индекс];
				Иначе
					Продолжить;
				КонецЕсли;
				
				// Читаем значение из Excel
				Значение = Лист.Cells(НомерСтроки, НомерКолонки).Value;
				
				Если Значение = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаЗаполнена = Истина;
				
				// Заполняем реквизит в зависимости от типа
				Если ИмяРеквизита = "Исполнитель" Тогда
					// Поиск сотрудника по наименованию
					НайденныйСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(СокрЛП(Строка(Значение)));
					Если НайденныйСотрудник <> Справочники.Сотрудники.ПустаяСсылка() Тогда
						НоваяСтрока[ИмяРеквизита] = НайденныйСотрудник;
					КонецЕсли;
				ИначеЕсли ИмяРеквизита = "ДатаДокумента" Или ИмяРеквизита = "СрокИсполнения" Или ИмяРеквизита = "ДатаИсполнения" Тогда
					// Преобразуем в дату
					Попытка
						Если ТипЗнч(Значение) = Тип("Дата") Тогда
							НоваяСтрока[ИмяРеквизита] = Значение;
						Иначе
							НоваяСтрока[ИмяРеквизита] = Дата(Строка(Значение));
						КонецЕсли;
					Исключение
						// Если не удалось преобразовать, оставляем пустым
					КонецПопытки;
				Иначе
					НоваяСтрока[ИмяРеквизита] = СокрЛП(Строка(Значение));
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаЗаполнена Тогда
				КоличествоЗагруженных = КоличествоЗагруженных + 1;
			Иначе
				// Удаляем пустую строку
				ОбъектСправочника[ИмяТЧ].Удалить(НоваяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		// Закрываем Excel
		Книга.Close();
		Excel.Quit();
		
		// Записываем объект
		ОбъектСправочника.Записать();
		
		ЗаписьЖурналаРегистрации("Загрузка завершена", УровеньЖурналаРегистрации.Информация, , , 
			"Загружено строк: " + КоличествоЗагруженных);
		
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка при загрузке из Excel", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		Сообщить("Ошибка при загрузке из Excel: " + ОписаниеОшибки());
		Возврат 0;
	КонецПопытки; 
	
	Возврат КоличествоЗагруженных;
	
КонецФункции
&НаКлиенте
Процедура ОбновитьФормуНаКлиенте(ИмяТЧ, КоличествоЗагруженных)
	
	// Обновляем табличную часть на форме
	Если ИмяТЧ = "СодержаниеДоговора" Тогда
		Элементы.СодержаниеДоговора.Обновить(); 	
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Загрузка завершена", , "Успешно загружено: " + КоличествоЗагруженных + " строк");
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
